from enum import Enum

class Currency(Enum):
    USD = 'USD'
    EUR = 'EUR'
    UAH = 'UAH'

class OperationType(str, Enum):
    INCOME = "INCOME"
    EXPENSE = "EXPENSE"



INCOME_CATEGORIES = {
    "Заробіток": [
        "Зарплата", "Премії", "Фріланс", "Підробітки"
    ],
    "Пасивний дохід": [
        "Дивіденди", "Відсотки з депозитів", "Оренда нерухомості"
    ],
    "Інвестиції": [
        "Продаж акцій", "Продаж криптовалюти"
    ],
    "Грошові надходження": [
        "Грошові подарунки", "Продаж речей", "Повернення боргу"
    ],
    "Державні виплати": [
        "Субсидії", "Пенсія", "Декретні", "Допомога по безробіттю"
    ],
    "Кешбек / Бонуси": [
        "Кешбек", "Бонуси банку", "Програми лояльності"
    ]
}

EXPENSE_CATEGORIES = {
    "Основні потреби": [
        "Продукти", "Оренда", "Комуналка", "Транспорт", "Аптека", "Одяг", "Взуття"
    ],
    "Комунальні послуги": [
        "Електроенергія", "Газ", "Вода", "Інтернет", "Мобільний зв'язок"
    ],
    "Фінансові зобов'язання": [
        "Кредити", "Іпотека", "Податки", "Штрафи", "Платні підписки"
    ],
    "Дозвілля та розваги": [
        "Ресторани", "Кафе", "Подорожі", "Кіно", "Театр", "Ігри"
    ],
    "Особистий розвиток": [
        "Курси", "Книги", "Освіта", "Спортзал"
    ],
    "Подарунки і благодійність": [
        "Подарунки", "Благодійність", "Донати"
    ],
    "Техніка та побут": [
        "Побутова техніка", "Гаджети", "Ремонт", "Меблі"
    ],
    "Діти": [
        "Дитячий садок", "Школа", "Іграшки", "Одяг для дітей"
    ],
    "Краса і здоров’я": [
        "Косметика", "Перукарня", "Салон краси", "Масаж"
    ],
    "Тварини": [
        "Корм", "Ветлікар", "Іграшки для тварин"
    ],
    "Інше": [
        "Переказ між рахунками", "Корекція", "Конвертація валюти"
    ]
}

ALL_CATEGORIES = {
    **INCOME_CATEGORIES,
    **EXPENSE_CATEGORIES
}

def validate_category_pair(category: str, subcategory: str) -> bool:
    """Перевіряє, чи вказана підкатегорія належить до заданої категорії. """
    return category in ALL_CATEGORIES and subcategory in ALL_CATEGORIES[category]
